# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

lst = [2, 2, 3, 5, 7, 8, 7, 12, 134, 134, 2, 7, 9, 8, 5, 6]

print(list(set(lst)))